---
kind: other
id: Properties.T:Autodesk.Revit.DB.IFC.IFCFile
source: html/5d57fd13-677d-f65c-a4e4-4ca58c834531.htm
---
# IFCFile Properties

Specifies whether the .NET object represents a valid Revit entity.